#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Thu Feb 20 13:49:26 2025

set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_sobel_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
